//IBMUSERX JOB (285),CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID,REGION=6M
//STEPDB2  EXEC PGM=IKJEFT01,DYNAMNBR=64
//STEPLIB  DD DSN=DSN810.SDSNLOAD,DISP=SHR
//         DD DSN=IBMUSER.T61.LOAD,DISP=SHR  == LOAD MODULE
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(500,50))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(500,50))
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//CLAIMDD1 DD DSN=IBMUSER.T61.CLAIM.OT1,DISP=(NEW,CATLG,DELETE),
//      SPACE=(TRK,(1,1),RLSE),UNIT=3390,VOL=SER=S7SYS1,
//      DCB=(DSORG=PS,LRECL=50,RECFM=FB,BLKSIZE=0)
//SYSTSIN  DD *
 DSN S(DB8G)
 RUN PROGRAM(CURSORU1) PLAN(S1304PL)
 END
/*
//
