       ID DIVISION.
       PROGRAM-ID. POLCYPGM.
       AUTHOR. UR NAME.
       DATE-WRITTEN. TODAY.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL INCLUDE DCLPOLCY END-EXEC.

       LINKAGE SECTION.
       01 CLAIM-DETAILS.
          03 POLICY-NUMBER   PIC  X(05) VALUE SPACE.
          03 CLAIM-NUMBER    PIC  X(05) VALUE SPACE.
          03 CLAIM-AMOUNT    PIC  9(03)V9(2) VALUE ZERO.
          03 CLAIM-SUBMIT-DT PIC  X(10)  VALUE SPACE.
          03 SUB-RTN-CODE    PIC  X(02) VALUE SPACE.
          03 REJECT-ERR-MSG  PIC  X(30) VALUE SPACE.

       PROCEDURE DIVISION USING CLAIM-DETAILS.
       000-MAIN-PARA.
           DISPLAY 'POLCY PGM STARTED'.
           MOVE POLICY-NUMBER   TO DCL-POLCY-NUMBER
           DISPLAY 'POLICY IN SUBPGM ' DCL-POLCY-NUMBER

           EXEC SQL
              SELECT POLCY_NUMBER , INSURED_AMT ,
                     POLCY_EXPIRE_DT
              INTO
                  :DCL-POLCY-NUMBER,
                  :DCL-INSURED-AMT,
                  :DCL-POLCY-EXPIRE-DT

              FROM POLCY_T6
              WHERE POLCY_NUMBER = :DCL-POLCY-NUMBER
           END-EXEC.

           IF SQLCODE = 0
              PERFORM 100-VALID-CLAIM-PARA THRU 100-EXIT
           ELSE
              MOVE '99' TO SUB-RTN-CODE
              MOVE 'POLCY NUM NOT FOUND ' TO REJECT-ERR-MSG
           END-IF.

           GOBACK.

       100-VALID-CLAIM-PARA.
           IF CLAIM-AMOUNT > DCL-INSURED-AMT
              MOVE '01' TO SUB-RTN-CODE
              MOVE 'CLAIM AMOUNT GT INSURED AMT ' TO REJECT-ERR-MSG
           ELSE
           IF CLAIM-SUBMIT-DT > DCL-POLCY-EXPIRE-DT
              MOVE '02' TO SUB-RTN-CODE
              MOVE 'CLAIM SUBMITTED AFT EXPIRE ' TO REJECT-ERR-MSG
           ELSE
              MOVE '00' TO SUB-RTN-CODE
           END-IF
           END-IF.

       100-EXIT. EXIT.
