//IBMUSERX JOB (285),CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID,REGION=6M
//STEPDB2  EXEC PGM=IKJEFT01,DYNAMNBR=64
//STEPLIB  DD DSN=DSN810.SDSNLOAD,DISP=SHR
//         DD DSN=IBMUSER.T5.LOAD,DISP=SHR  == LOAD MODULE
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(500,50))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(500,50))
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSTSIN  DD *
 DSN S(DB8G)
 RUN PROGRAM(CLAIMPGM) PLAN(S1304PL)
 END
/*
//
