//MATEKSD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//*  COBOL + DB2 PRECOMPILE AND LINKEDIT.
//*
//DBPREC  EXEC DB2COBCL, 
//			   COPYLIB=MATEKS.COPYLIB,      <= COPYBOOK LIBRARY
//			   DCLGLIB=MATEKS.DCLGEN.COBOL, <= DCLGEN LIBRARY
//			   DBRMLIB=MATEKS.DBRMLIB,      <= DBRM LIBRARY
//			   LOADLIB=MATEKS.LOADLIB,      <= LOAD LIBRARY
//			   SRCLIB=MATEKS.DB2.COBOL,     <= SOURCE LIBRARY
//			   MEMBER=PGM-NAME              <= SOURCE MEMBER