//MATEKSD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//*	Run JCL...
//*		
//STEP01   EXEC PGM=IKJEFT01,
//		       DYNAMNBR=20,REGION=4096K
//STEPLIB  DD  DISP=SHR,DSN=DSNA10.DBAG.SDSNEXIT
//         DD  DISP=SHR,DSN=DSNA10.SDSNLOAD
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
DSN SYSTEM	(DBAG	)
  RUN PROGRAM	(PGM-NAME )	-
  PLAN		    (MKSP01	)	-
  LIBRARY	('MATEKS.LOADLIB')
END
/*
//SYSOUT   DD  SYSOUT=* 
